---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies
source: html/ccbdf68a-5d8d-50a0-8332-8aa8aa128921.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.UnableToUpgradeDueToCorruptFamilies Property

Some families have become unusable. Reload the families, or delete them from the model.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToUpgradeDueToCorruptFamilies { get; }
```